Documents/КорректировкаОстатковЗаписейСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаОстатковЗаписейСкладскогоЖурнала</Name>
			<Comment>Корректировка остатков записей складского журнала</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаписейСкладскогоЖурнала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвижениеПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ДвижениеПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КорректировкаОстатковЗаписейСкладскогоЖурнала/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ДополнительныеСвойства.Вставить("БылПроведен", Проведен);
	ДополнительныеСвойства.Вставить("ДатаСтарая",  Дата);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
	
	Если ДополнительныеСвойства.БылПроведен И ДополнительныеСвойства.ДатаСтарая < Дата Тогда
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ТаблицаЗаписейСкладскогоЖурнала.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ДвижениеПродукции.Записывать = Истина;
	Движения.ДвижениеПродукции.Очистить();
	Если ДополнительныеСвойства.ДатаДокументаСдвинутаВперед Тогда
		Движения.ДвижениеПродукции.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Ссылка.Организация,
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Ссылка.Предприятие,
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала,
		|	СУММА(КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Количество) КАК Количество
		|ПОМЕСТИТЬ ДокТЧ
		|ИЗ
		|	Документ.КорректировкаОстатковЗаписейСкладскогоЖурнала.ТаблицаЗаписейСкладскогоЖурнала КАК КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала
		|ГДЕ
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Ссылка.Предприятие,
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала,
		|	КорректировкаОстатковЗаписейСкладскогоЖурналаТаблицаЗаписейСкладскогоЖурнала.Ссылка.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокТЧ.ЗаписьСкладскогоЖурнала
		|ИЗ
		|	ДокТЧ КАК ДокТЧ";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДвижениеПродукции");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Предприятие", Предприятие);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаписьСкладскогоЖурнала", "ЗаписьСкладскогоЖурнала");
	Блокировка.Заблокировать();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДвижениеПродукцииОстатки.Организация КАК Организация,
		|	ДвижениеПродукцииОстатки.Предприятие КАК Предприятие,
		|	ДвижениеПродукцииОстатки.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ДвижениеПродукцииОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ДвижениеПродукции.Остатки(
		|			&МоментВремени,
		|			(Организация, Предприятие, ЗаписьСкладскогоЖурнала) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Организация,
		|					ДокТЧ.Предприятие,
		|					ДокТЧ.ЗаписьСкладскогоЖурнала
		|				ИЗ
		|					ДокТЧ КАК ДокТЧ)) КАК ДвижениеПродукцииОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Остатки.Количество > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Предприятие КАК Предприятие,
		|	Остатки.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ВЫБОР
		|		КОГДА Остатки.Количество < 0
		|			ТОГДА -Остатки.Количество
		|		ИНАЧЕ Остатки.Количество
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ ДвиженияПоОстаткам
		|ИЗ
		|	Остатки КАК Остатки
		|ГДЕ
		|	Остатки.Количество <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	ДвиженияПоОстаткам.ВидДвижения КАК ВидДвижения,
		|	ДвиженияПоОстаткам.Организация КАК Организация,
		|	ДвиженияПоОстаткам.Предприятие КАК Предприятие,
		|	ДвиженияПоОстаткам.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	СУММА(ДвиженияПоОстаткам.Количество) КАК Количество
		|ИЗ
		|	ДвиженияПоОстаткам КАК ДвиженияПоОстаткам
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияПоОстаткам.ВидДвижения,
		|	ДвиженияПоОстаткам.Организация,
		|	ДвиженияПоОстаткам.Предприятие,
		|	ДвиженияПоОстаткам.ЗаписьСкладскогоЖурнала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ДокТЧ.Организация,
		|	ДокТЧ.Предприятие,
		|	ДокТЧ.ЗаписьСкладскогоЖурнала,
		|	ДокТЧ.Количество
		|ИЗ
		|	ДокТЧ КАК ДокТЧ
		|ГДЕ
		|	ДокТЧ.Количество > 0";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Период", Дата);

	Движения.ДвижениеПродукции.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
